



#include "aduc812.h"
#include "led.h"
#include "max.h"
#include "sound.h"
#include "timer.h"


static unsigned char int_counter = 0;

void INT0_ISR( void ) __interrupt ( 2 ) __using ( 2 );







///////////////////////////////////////////////////////////////////////////
// Инициализация счетчика
///////////////////////////////////////////////////////////////////////////
void InitCounter( void ){

	
	SetVector( 0x2003, (void *)INT0_ISR );
	//Установка вектора прерываний в пользовательской таблице
	IT0=0x1; //Определяем тип запроса прерывания: по спаду, а не по уровню
	//write_max(ENA, read_max(ENA) | 0b0100000); //5 бит ENA = 1
	write_max(ENA, 0b0100000);
	
	EX0=1; //Разрешение внешнего прерывания 0
	EA = 1; //Разрешение всех прерываний
}


//////////////////////// INT0_ISR //////////////////////////////
// Обработчик внешнего прерывания
//////////////////////////////////////////////////////////////
void INT0_ISR( void ) __interrupt ( 2 ) __using ( 2 )
{
	leds( int_counter++ );
	//DelayMs( 50 );	
}








